#include <iostream>
using namespace std;
int main()
{
	int const m = 10;	//Количество элементов в массивах;
	int a[m],b[m];		//Массивы;
	int i = 0,j = 0;
	for (i=0; i<m; i++)
	{
		cout << "Введите " << i+1 << " элемент ";
		cin >> a[i];		// Считывание элемента;
		if (i==1 && a[i-1] != a[i])	// Случай A B ... , т.е. сверяем первый с вторым;
		{
			b[j]=a[i-1];
			j+=1;
			//cout << b[j] << endl;
		}
		if (i>1 && a[i-2] != a[i-1] && a[i-1] != a[i])	// Случай ... B A B ... , т.е. с второго и до последнего не включительно проверяем в каждой тройке центральный элемент с левым и правым;
		{
			b[j]=a[i-1];
			j+=1;
		} 
		if (i==m-1 && a[i-1] != a[i])	 //  Случай ... B A , т.е. сверяем последний с предпоследним;
		{
			b[j]=a[i];
			j+=1;
		}
	}
	cout << "Новый массив : " << endl;
	for (i=0; i<j; i++)
		cout << b[i] << " ";
	return 0;
}
